# ETL Project
## Pandasy Football: The SQL
### Team Members:
* Bao
* JR
* Tom
* Tiffany

In [1]:
#import dependencies
import csv
import pandas as pd
from sqlalchemy import create_engine

### Transform CSV files

In [2]:
# import csv files
csvfile19 = "./Resources/2019.csv"
csv_df19 = pd.read_csv(csvfile19)
csv_df19["Year"] = 2019

csvfile18 = "./Resources/2018.csv"
csv_df18 = pd.read_csv(csvfile18)
csv_df18["Year"] = 2018

csvfile17 = "./Resources/2017.csv"
csv_df17 = pd.read_csv(csvfile17)
csv_df17["Year"] = 2017

csvfile16 = "./Resources/2016.csv"
csv_df16 = pd.read_csv(csvfile16)
csv_df16["Year"] = 2016

csvfile15 = "./Resources/2015.csv"
csv_df15 = pd.read_csv(csvfile15)
csv_df15["Year"] = 2015

In [3]:
#view sample data from csv 2019 file
csv_df19.head()

,Unnamed: 0,Player,Tm,Pos,Age,G,GS,Cmp,Att,Yds,...,PassingYds,PassingTD,PassingAtt,RushingYds,RushingTD,RushingAtt,ReceivingYds,ReceivingTD,FantasyPoints,Year
0,0,Christian McCaffrey,CAR,RB,23.0,16.0,16.0,0.0,2.0,0.0,...,0.0,0.0,2.0,1387.0,15.0,287.0,1005.0,4.0,469.20,2019
1,1,Lamar Jackson,BAL,QB,22.0,15.0,15.0,265.0,401.0,3127.0,...,3127.0,36.0,401.0,1206.0,7.0,176.0,0.0,0.0,415.68,2019
2,2,Derrick Henry,TEN,RB,25.0,15.0,15.0,0.0,0.0,0.0,...,0.0,0.0,0.0,1540.0,16.0,303.0,206.0,2.0,294.60,2019
3,3,Aaron Jones,GNB,RB,25.0,16.0,16.0,0.0,0.0,0.0,...,0.0,0.0,0.0,1084.0,16.0,236.0,474.0,3.0,314.80,2019
4,4,Ezekiel Elliott,DAL,RB,24.0,16.0,16.0,0.0,0.0,0.0,...,0.0,0.0,0.0,1357.0,12.0,301.0,420.0,2.0,311.70,2019

In [4]:
#view list of columns in sample data 2019 csv file
csv_df19.columns

Index(['Unnamed: 0', 'Player', 'Tm', 'Pos', 'Age', 'G', 'GS', 'Cmp', 'Att',
       'Yds', 'Int', 'Att.1', 'Yds.1', 'Tgt', 'Rec', 'Yds.2', 'Y/R', 'Fumbles',
       'FumblesLost', 'PassingYds', 'PassingTD', 'PassingAtt', 'RushingYds',
       'RushingTD', 'RushingAtt', 'ReceivingYds', 'ReceivingTD',
       'FantasyPoints', 'Year'],
      dtype='object')

In [5]:
#Choose columns for dataframe creation
columns = ['Player', 'Tm', 'Pos', 'Age', 'FantasyPoints', 'Year']

In [6]:
#Filter original csv files based on columns chosen, put in new df
new_csv_df19 = csv_df19[columns].copy()
new_csv_df18 = csv_df18[columns].copy()
new_csv_df17 = csv_df17[columns].copy()
new_csv_df16 = csv_df16[columns].copy()
new_csv_df15 = csv_df15[columns].copy()

In [7]:
#drop invalid position 0
new_csv_df19 = new_csv_df19.loc[new_csv_df19['Pos'] != '0']
new_csv_df18 = new_csv_df18.loc[new_csv_df18['Pos'] != '0']
new_csv_df17 = new_csv_df17.loc[new_csv_df17['Pos'] != '0']
new_csv_df16 = new_csv_df16.loc[new_csv_df16['Pos'] != '0']
new_csv_df15 = new_csv_df15.loc[new_csv_df15['Pos'] != '0']

In [8]:
#drop duplicate player names that exist on different teams
#this is a data limitation since there is not a unique player ID
new_csv_df19.drop_duplicates(subset=['Player'],inplace=True)
new_csv_df18.drop_duplicates(subset=['Player'],inplace=True)
new_csv_df17.drop_duplicates(subset=['Player'],inplace=True)
new_csv_df16.drop_duplicates(subset=['Player'],inplace=True)
new_csv_df15.drop_duplicates(subset=['Player'],inplace=True)

### Transform csv file created from API call

In [9]:
#import API csv file
api_csv = "./Resources/api_player_data.csv"
api_csvdf = pd.read_csv(api_csv)

In [10]:
#view list of columns in csv file created from api
api_csvdf.columns

Index(['Unnamed: 0', 'PlayerID', 'Name', 'Height', 'HeightFeet',
       'HeightInches', 'Weight', 'Experience', 'Position', 'ADP', 'Salary'],
      dtype='object')

In [11]:
#drop columns that are not needed for dataframe creation
api_drop_columns = ['Unnamed: 0', 'PlayerID', 'Height', 'Salary', 'Position']

In [12]:
#view sample data from csv file created from api
api_csvdf.head()

,Unnamed: 0,PlayerID,Name,Height,HeightFeet,HeightInches,Weight,Experience,Position,ADP,Salary
0,0,7242,Drew Brees,"6'0""",6.0,0.0,209.0,24.0,QB,86.8,NaN
1,1,20446,Trevon Mathis,"6'0""",6.0,0.0,174.0,1.0,CB,NaN,NaN
2,2,20448,Jonathan Wynn,"6'4""",6.0,4.0,260.0,3.0,DE,1693.0,NaN
3,3,21741,Denzel Mims,"6'3""",6.0,3.0,207.0,3.0,WR,213.3,NaN
4,4,21797,La'Mical Perine,"5'11""",5.0,11.0,216.0,0.0,RB,255.8,NaN

In [13]:
#Filter api csv file based on columns chosen, put in new df
new_api_csvdf = api_csvdf.drop(columns=api_drop_columns)

In [14]:
#drop rows with NA (ADP column had NaN values)
new_api_csvdf.dropna(inplace=True)

In [15]:
#combine height in feet with height in inches to create total height in inches
new_api_csvdf["Height_in"] = (new_api_csvdf["HeightFeet"] * 12) + new_api_csvdf["HeightInches"]

In [16]:
#view sample data from api file
new_api_csvdf.head()

,Name,HeightFeet,HeightInches,Weight,Experience,ADP,Height_in
0,Drew Brees,6.0,0.0,209.0,24.0,86.8,72.0
2,Jonathan Wynn,6.0,4.0,260.0,3.0,1693.0,76.0
3,Denzel Mims,6.0,3.0,207.0,3.0,213.3,75.0
4,La'Mical Perine,5.0,11.0,216.0,0.0,255.8,71.0
16,Ashtyn Davis,6.0,1.0,202.0,0.0,2116.2,73.0

In [17]:
#now that we have combined height feet with height inches, these columns are no longer needed
new_api_csvdf.drop(columns=['HeightFeet', 'HeightInches'], inplace=True)

In [18]:
#view sample data from api file after dropped columns
new_api_csvdf.head()

               Name  Weight  Experience     ADP  Height_in
0        Drew Brees   209.0        24.0    86.8       72.0
2     Jonathan Wynn   260.0         3.0  1693.0       76.0
3       Denzel Mims   207.0         3.0   213.3       75.0
4   La'Mical Perine   216.0         0.0   255.8       71.0
16     Ashtyn Davis   202.0         0.0  2116.2       73.0

In [19]:
#reorder columns to move height and weight next to each other
reorder_col_api = ['Name', 'Height_in', 'Weight', 'Experience', 'ADP']
reorder_col_api_csvdf = new_api_csvdf.reindex(columns=reorder_col_api)
reorder_col_api_csvdf.drop_duplicates(subset=['Name'], inplace=True)

## Create connection to Postgres, import dataframes

In [20]:
#create a connection to postgres
connection_string = "postgres:password@localhost:5432/pandasySQL_db"
engine = create_engine(f'postgresql://{connection_string}')

In [21]:
#get table names, ensures a successful connection
engine.table_names()

['player2019',
 'player2018',
 'player2017',
 'player2016',
 'player2015',
 'playerStats']

In [22]:
#append transformed dataframes to postgressql tables
new_csv_df19.to_sql(name='player2019', con=engine, if_exists='append', index=False)
new_csv_df18.to_sql(name='player2018', con=engine, if_exists='append', index=False)
new_csv_df17.to_sql(name='player2017', con=engine, if_exists='append', index=False)
new_csv_df16.to_sql(name='player2016', con=engine, if_exists='append', index=False)
new_csv_df15.to_sql(name='player2015', con=engine, if_exists='append', index=False)
reorder_col_api_csvdf.to_sql(name='playerStats', con=engine, if_exists='append', index=False)

# Confirm data is in the postgres tables

In [23]:
pd.read_sql_query('select * from player2019', con=engine).head()

           Player   Tm Pos  Age  FantasyPoints  Year
0   George Kittle  SFO  TE   26         222.50  2019
1  Deshaun Watson  HOU  QB   24         318.98  2019
2    Chris Carson  SEA  RB   25         232.60  2019
3   Darren Waller  OAK  TE   27         221.00  2019
4  Kenny Golladay  DET  WR   26         248.00  2019

In [24]:
pd.read_sql_query('select * from player2018', con=engine).head()

           Player   Tm Pos  Age  FantasyPoints  Year
0      Mike Evans  TAM  WR   25          284.4  2018
1       Zach Ertz  PHI  TE   28          280.3  2018
2    Adam Thielen  MIN  WR   28          305.3  2018
3  Michael Thomas  NOR  WR   25          315.5  2018
4      Eric Ebron  IND  TE   25          222.2  2018

In [25]:
pd.read_sql_query('select * from player2017', con=engine).head()

             Player   Tm Pos  Age  FantasyPoints  Year
0      Kyle Rudolph  MIN  TE   28         158.20  2017
1    Delanie Walker  TEN  TE   33         174.50  2017
2  Matthew Stafford  DET  QB   29         269.64  2017
3        Frank Gore  IND  RB   34         173.60  2017
4    Marshawn Lynch  OAK  RB   31         164.20  2017

In [26]:
pd.read_sql_query('select * from player2016', con=engine).head()

          Player   Tm Pos  Age  FantasyPoints  Year
0  Brandin Cooks  NOR  WR   23         246.30  2016
1     Greg Olsen  CAR  TE   31         205.30  2016
2    Andrew Luck  IND  QB   27         303.70  2016
3   Kyle Rudolph  MIN  TE   27         209.00  2016
4   Kirk Cousins  WAS  QB   28         300.28  2016

In [27]:
pd.read_sql_query('select * from player2015', con=engine).head()

             Player   Tm Pos  Age  FantasyPoints  Year
0       Eric Decker  NYJ  WR   28          252.7  2015
1  Larry Fitzgerald  ARI  WR   32          280.5  2015
2     Brandin Cooks  NOR  WR   22          253.6  2015
3   Latavius Murray  OAK  RB   25          204.8  2015
4  Demaryius Thomas  DEN  WR   28          267.4  2015

In [28]:
pd.read_sql_query('select * from "playerStats"', con=engine).head()

            Name  Height_in  Weight  Experience     ADP
0    Joshua Kalu       72.0   203.0           4  1682.6
1  Mario Addison       75.0   260.0          13   745.6
2   Cole Beasley       68.0   174.0          11   207.6
3  Isaac Rochell       76.0   280.0           5  1410.8
4   Amani Hooker       71.0   210.0           4  1785.9